app/views/application/home.html.haml

            %i.right.arrow.icon
          - if current_user.tests.pluck(:score).compact.present?
---
SELECT  1 AS one FROM "tests" WHERE "tests"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "tests"."score" FROM "tests" WHERE "tests"."user_id" = $1  [["user_id", 1]]